#include <iostream>

// Необходимо написать несколько реализаций интерфейса:
// - ListGraph, хранящий граф в виде массива списков смежности,
// - MatrixGraph, хранящий граф в виде матрицы смежности,
// - SetGraph, хранящий граф в виде массива хэш-таблиц/сбалансированных деревьев поиска,
// - ArcGraph, хранящий граф в виде одного массива пар {from, to}.
// Также необходимо реализовать конструктор, принимающий const IGraph&.
// Такой конструктор должен скопировать переданный граф в создаваемый объект.
// Для каждого класса создавайте отдельные h и cpp файлы.
// Число вершин графа задается в конструкторе каждой реализации.


int main(int argc, const char * argv[]) {
    // insert code here...
    std::cout << "Hello, World!\n";
    return 0;
}
